/*	Задание 06. Парты
*
*	В Вашей школе решили набрать три новых математических класса
*	и оборудовать кабинеты для них новыми партами.
*	За каждой партой может сидеть только два учащихся.
*	Известно количество учащихся в каждом из трех классов.
*	Выведите наименьшее число парт, которое нужно приобрести для них.
*	Каждый класс сидит в своем кабинете.
*
*	Формат входных данных [input]
*	Программа получает на вход три целых неотрицательных числа:
*	количество учащихся в каждом из трех классов (числа не превышают 1000).
*
*	Формат выходных данных [output]
*	Выведите одно целое число - ответ на задачу.
*
*	[Sample function input 1]: 20 21 22
*	[Sample function output 1]: 32
*
*	[Sample function input 2]: 16 18 20
*	[Sample function output 2]: 27
*
*	[Sample function input 3]: 19 15 23
*	[Sample function output 3]: 30
*/

#include "Tasks.h"

int task06(int a, int b, int c) {
	return 0;
}