/*	Задание 04. Коробки (Boxes)
*
*	Шахматный слон (chess bishop) ходит только по диагоналям.
*	Даны две различные клетки шахматной доски, определите,
*	может ли слон попасть с первой клетки на вторую одним ходом.
*
*	Формат входных данных [input]
*	Функция принимает на вход четыре числа от 1 до 8 каждое,
*	задающие номер столбца и номер строки сначала для первой клетки (x1, y1),
*	потом для второй клетки (x2, y2).
*
*	Формат выходных данных [output]
*	Программа должна вывести "YES", если из первой клетки (x1, y1) ходом слона
*	можно попасть во вторую (x2, y2) или "NO" в противном случае.
*
*	[Sample function input 1] (пример передаваемых в функцию параметров): 4 4 5 5
*	[Sample function output 1] (пример возвращаемого функцией результата): YES
*
*	[Sample function input 2] (пример передаваемых в функцию параметров): 4 4 4 8
*	[Sample function output 2] (пример возвращаемого функцией результата): NO
*/

#include "Tasks.h"

string task04(int a1, int b1, int c1, int a2, int b2, int c2) {
	return "?";
}