/*	Задание 05. Прямоугольный мир (1)
*
*	В прямоугольном мире свинья, раскормленная до размеров параллелепипеда,
*	лежит в квадратной луже грязи. Определите, полностью ли основание свиньи помещается
*	в данную лужу или нет. Если помещается полностью, то необходимо возвратить YES,
*	если не помещается, то необходимо возвратить NO.
*
*	Формат входных данных [input]
*	Функция получает на вход три целых натуральных числа W, L, S: 
*	ширину и длину прямоугольной свиньи и сторону квадратной лужи.
*
*	Формат выходных данных [output]
*	Функция должна возвратить одно из двух слов: "YES" или "NO".
*
*	[Sample function input 1]: 4 6 5
*	[Sample function output 1]: NO
*
*	[Sample function input 2]: 3 5 5
*	[Sample function output 2]: YES
*/

#include "Tasks.h"

string task05(int width, int length, int side) {
	return "?";
}