/*	Задание 06. Прямоугольный мир (2)
*
*	В прямоугольном мире есть свинья, раскормленная до размеров параллелепипеда.
*	Определите, может ли основание свиньи полностью поместиться в прямоугольную лужу грязи,
*	заданную сторонами А и B. Если помещается полностью, то необходимо возвратить YES,
*	если не помещается, то необходимо возвратить NO.
*
*	Формат входных данных [input]
*	Функция получает на вход четыре целых натуральных числа W, L, A и B:
*	ширину и длину прямоугольной свиньи и стороны прямоугольной лужи.
*
*	Формат выходных данных [output]
*	Функция должна возвратить одно из двух слов: "YES" или "NO".
*
*	[Sample function input 1]: 4 6 5 5
*	[Sample function output 1]: NO
*
*	[Sample function input 2]: 3 5 5 4
*	[Sample function output 2]: YES
*/

#include "Tasks.h"

string task06(int width, int length, int a, int b) {
	return "?";
}