/*	Задание 01. Белочки и орешки (1)
*
*	N белочек нашли K орешков и решили разделить их поровну.
*	Определите, сколько орешков достанется каждой белочке.
*
*	Формат входных данных [input]
*	На вход дается два целых положительных числа N и K, каждое из которых не превышает 10000.
*
*	Формат выходных данных [output]
*	Выведите одно целое число - ответ на задачу.
*
*	[Sample function input] (пример передаваемых в функцию параметров): 3 14
*
*	[Sample function output] (пример возвращаемого функцией результата): 4
*/

#include "Tasks.h"

int task01(int numberOfSquirrels, int numberOfNuts) {
	return 0;
}