/*	Задание 01. Наибольшее число
*
*	Даны два целых числа. Выведите значение наибольшего из них. 
*	Если числа равны, выведите любое из них.
*
*	Формат входных данных [input]
*	Функция принимает два целых числа.
*
*	Формат выходных данных [output]
*	Функция должна вывести наибольшее число.
*
*	[Sample function input 1] (пример передаваемых в функцию параметров): 10 15
*	[Sample function output 1] (пример возвращаемого функцией результата): 15
*
*	[Sample function input 2] (пример передаваемых в функцию параметров): 40 25
*	[Sample function output 2] (пример возвращаемого функцией результата): 40
*/

#include "Tasks.h"

int task01(int a, int b) {	
	return 0;
}