/*	Задание 02. Белочки и орешки (2)
*
*	N белочек нашли K орешков и решили разделить их поровну.
*	Определите, сколько орешков останется после того,
*	как все белочки возьмут себе равное количество орешков.
*
*	Формат входных данных [input]
*	На вход дается два целых положительных числа N и K, каждое из которых не превышает 10000.
*
*	Формат выходных данных
*	Выведите одно целое число - ответ на задачу.
*
*	[Sample function input]: 4 18
*	[Sample function output]: 2
*/

#include "Tasks.h"

int task02(int numberOfSquirrels, int numberOfNuts) {
	return 0;
}