/*	Задание 03. Число десятков
*
*	Дано целое неотрицательное число N, определите число десятков в нем (предпоследнюю цифру числа).
*	Если предпоследней цифры нет, то можно считать, что число десятков равно нулю.
*
*	Формат входных данных [input]
*	На вход дается целое положительное число N (0 ≤ N ≤ 1000000).
*
*	Формат выходных данных [output]
*	Выведите одно целое число - ответ на задачу.
*
*	[Sample function input 1]: 456
*	[Sample function output 1]: 5
*
*	[Sample function input 2]: 1234567
*	[Sample function output 2]: 6
*/

#include "Tasks.h"

int task03(int number) {
	return 0;
}